app/views/posts/_form.html.erb

    <%#@tags.each do |each_tag| %>
    <%= f.collection_check_boxes(:tag_ids,Tag.all,:id,:name) %><br>
---
SELECT "tags".* FROM "tags"