app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hi"], ["content", "sjfdkal"], ["created_at", "2015-08-31 22:35:46.399599"], ["updated_at", "2015-08-31 22:35:46.399599"]]